Project/Toir/src/Documents/торо_ВыявленныеДефекты/торо_ВыявленныеДефекты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>торо_ВыявленныеДефекты</name>
  <basedOn>Document.торо_ВнешнееОснованиеДляРабот</basedOn>
  <basedOn>Document.торо_СостоянияОбъектовРемонта</basedOn>
  <basedOn>Document.торо_УчетКонтролируемыхПоказателей</basedOn>
  <basedOn>Document.торо_АктОВыполненииРегламентногоМероприятия</basedOn>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВыявленныхДефектов</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВыявленныхДефектовУстановленные</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВнешнихОснованийУстановленные</registerRecords>
  <registerRecords>InformationRegister.торо_Ремонты</registerRecords>
  <registerRecords>InformationRegister.торо_ВыявленныеДефекты</registerRecords>
  <registerRecords>InformationRegister.торо_ВнешниеОснованияДляРабот</registerRecords>
  <registerRecords>InformationRegister.торо_СтатусыДокументовВнешнихОснований</registerRecords>
  <attributes>
    <name>ДатаОбнаружения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДефектВыявленВПроцессе</name>
    <type>
      <types>CatalogRef.торо_УсловияВыявленияДефекта</types>
      <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>КонтактноеЛицоИнициатора</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Инициатор</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
      <types>CatalogRef.Контрагенты</types>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Ответственный</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>СпособСогласования</name>
    <type>
      <types>CatalogRef.торо_СпособыСогласованияДокументов</types>
    </type>
  </attributes>
  <attributes>
    <name>СтатусДокумента</name>
    <type>
      <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
    </type>
  </attributes>
  <attributes>
    <name>ПодразделениеИсполнитель</name>
    <type>
      <types>CatalogRef.СтруктураПредприятия</types>
    </type>
  </attributes>
  <attributes>
    <name>Комиссия</name>
    <type>
      <types>CatalogRef.торо_Комиссии</types>
    </type>
  </attributes>
  <attributes>
    <name>ИзМобильного</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Влияние</name>
    <type>
      <types>EnumRef.гкс_Влияние</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ДатаУтверждения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ДефектОформленПоТАГ</name>
    <comment>TOIR20-454</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_НарядЗаданиеНомер</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_КатегорияРиска</name>
    <type>
      <types>CatalogRef.торо_КатегорииРиска</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_КачественнаяОценка</name>
    <comment>TOIR20-576</comment>
    <type>
      <types>EnumRef.гкс_КачественнаяОценкаКритичности</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_НомерТАГ</name>
    <comment>TOIR20-454</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_ОписаниеДефектаСписком</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>500</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Приоритет</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_СимптомДефекта</name>
    <type>
      <types>CatalogRef.гкс_СимптомыДефектов</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_СпециализацияТехническогоСпециалиста</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_СрочностьВоздействия</name>
    <comment>8220 Тарасов</comment>
    <type>
      <types>EnumRef.гкс_СрочностьВоздействия</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_Утвердил</name>
    <type>
      <types>CatalogRef.Сотрудники</types>
    </type>
  </attributes>
  <attributes>
    <name>гкс_IDОбращенияАРМО</name>
    <comment>TOIR20-598</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>гкс_НомерОбращенияАРМО</name>
    <comment>TOIR20-598</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </attributes>
  <tabularSections>
    <name>СписокДефектов</name>
    <attributes>
      <name>ВидДефекта</name>
      <type>
        <types>CatalogRef.торо_ВидыДефектов</types>
      </type>
    </attributes>
    <attributes>
      <name>ДефектВыявленВПроцессе</name>
      <type>
        <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ДефектОписание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДефектПричина</name>
      <type>
        <types>CatalogRef.торо_ПричиныДефектов</types>
      </type>
    </attributes>
    <attributes>
      <name>НаправлениеНаУстранение</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектРемонта</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтказавшийЭлемент</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ПоследствияДефекта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>150</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВидРемонтов</name>
      <type>
        <types>CatalogRef.торо_ВидыРемонтов</types>
      </type>
    </attributes>
    <attributes>
      <name>КритичностьДефекта</name>
      <type>
        <types>CatalogRef.торо_КритичностьДефекта</types>
      </type>
    </attributes>
    <attributes>
      <name>ТиповойДефект</name>
      <type>
        <types>CatalogRef.торо_ТиповыеДефектыОборудования</types>
      </type>
    </attributes>
    <attributes>
      <name>ID</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЗакрываетПредписание</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ДокументИсточник</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
        <types>DocumentRef.торо_УчетКонтролируемыхПоказателей</types>
        <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
        <types>DocumentRef.торо_СостоянияОбъектовРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ПодразделениеИсполнитель</name>
      <type>
        <types>CatalogRef.СтруктураПредприятия</types>
      </type>
    </attributes>
    <attributes>
      <name>ГарантийныйРемонт</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ГарантийныйОбъект</name>
      <type>
        <types>CatalogRef.торо_ОбъектыРемонта</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаНачалаРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>ДатаОкончанияРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>гкс_СимптомДефекта</name>
      <type>
        <types>CatalogRef.гкс_СимптомыДефектов</types>
      </type>
    </attributes>
    <attributes>
      <name>гкс_КорневаяПричина</name>
      <type>
        <types>CatalogRef.гкс_КорневыеПричины</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДокументыОснования</name>
    <attributes>
      <name>ДокументОснование</name>
      <type>
        <types>DocumentRef.торо_ВнешнееОснованиеДляРабот</types>
        <types>DocumentRef.торо_УчетКонтролируемыхПоказателей</types>
        <types>DocumentRef.торо_АктОВыполненииРегламентногоМероприятия</types>
        <types>DocumentRef.торо_СостоянияОбъектовРемонта</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ИсторияСтатусов</name>
    <attributes>
      <name>Дата</name>
      <type>
        <types>Date</types>
      </type>
    </attributes>
    <attributes>
      <name>Пользователь</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>ЗаКого</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Согласующие</name>
    <attributes>
      <name>Согласующий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Согласовано</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ПроведениеДокумента</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СтатусДокумента</name>
      <type>
        <types>CatalogRef.торо_СтатусыСогласованияДокументовРемонтныхРабот</types>
      </type>
    </attributes>
    <attributes>
      <name>Замещающий</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ответственные</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ОтветственныеЛица</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ДополнительныеРеквизиты</name>
    <attributes>
      <name>Свойство</name>
      <type>
        <types>ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение</name>
      <type>
        <types>Characteristic.ДополнительныеРеквизитыИСведения</types>
      </type>
    </attributes>
    <attributes>
      <name>ТекстоваяСтрока</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>РезультатыПодбораИзМатрицыОценкиРисков</name>
    <attributes>
      <name>ID_Ремонта</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>36</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ОбъектВоздействия</name>
      <type>
        <types>CatalogRef.торо_ОбъектыВоздействия</types>
      </type>
    </attributes>
    <attributes>
      <name>КатегорияРиска</name>
      <type>
        <types>CatalogRef.торо_КатегорииРиска</types>
      </type>
    </attributes>
    <attributes>
      <name>РезультатВыбора</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>гкс_ФайлыФиксации</name>
    <comment>TOIR20-598</comment>
    <attributes>
      <name>НаименованиеФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИдентификаторФайла</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>300</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

Project/Toir/src/InformationRegisters/торо_Ремонты/торо_Ремонты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>торо_Ремонты</name>
  <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ДатаНачалаПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияПлан</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаНачалаФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ДатаОкончанияФакт</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>СпособВыполнения</name>
    <type>
      <types>EnumRef.СпособыСтроительства</types>
    </type>
  </resources>
  <resources>
    <name>ГарантийныйРемонт</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КрайняяДопустимаяДатаЗавершенияРемонта</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <dimensions>
    <name>ID</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>ОбъектРемонта</name>
    <type>
      <types>CatalogRef.торо_ОбъектыРемонта</types>
      <types>CatalogRef.торо_СписокОбъектовРегламентногоМероприятия</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ВидРемонта</name>
    <type>
      <types>CatalogRef.торо_ВидыРемонтов</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

Project/Toir/src/Documents/торо_ВыявленныеДефекты/Forms/ФормаЖурналаДефектов/Module.bsl
#Область ОбработчикиКомандФормы
&НаКлиенте
Процедура СформироватьЖурналДефектов(Команда)
	
	Отказ = Ложь;

	Если ЗначениеЗаполнено(НачПериода) Тогда
		Если НЕ ЗначениеЗаполнено(КонПериода) Тогда
			ТекстСообщения = НСтр("es='Es necesario rellenar la fecha de la terminación del período.';ru='Необходимо заполнить дату окончания периода.';en='Required to fill in the end date of the period.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		ИначеЕсли КонПериода < НачПериода Тогда
			ТекстСообщения = НСтр("es='La fecha de la terminación del período es más pequeña que la fecha de su comienzo.';ru='Дата окончания периода меньше даты его начала.';en='End date of the period is less than the start date.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
	ИначеЕсли ЗначениеЗаполнено(КонПериода) Тогда
		Если НЕ ЗначениеЗаполнено(НачПериода) Тогда
			ТекстСообщения = НСтр("es='Es necesario rellenar la fecha del comienzo del período.';ru='Необходимо заполнить дату начала периода.';en='Required to complete the start date of the period.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		ИначеЕсли КонПериода < НачПериода Тогда
			ТекстСообщения = НСтр("es='La fecha de la terminación del período es más pequeña que la fecha de su comienzo.';ru='Дата окончания периода меньше даты его начала.';en='End date of the period is less than the start date.'");
			ОбщегоНазначенияКлиент.СообщитьПользователю(ТекстСообщения,,,, Отказ);
		КонецЕсли;
	КонецЕсли;		
 	Результат=ПолучитьСписокДефектов();	
КонецПроцедуры

&НаКлиенте
Процедура ПечатьЖурналаДефектов(Команда)
	
	СформироватьЖурналДефектов(Неопределено);
	Результат.Напечатать(РежимИспользованияДиалогаПечати.Использовать);

КонецПроцедуры
#КонецОбласти

#Область СлужебныеПроцедурыИФункции
&НаСервере
Функция ПолучитьСписокДефектов()		
	
		ТабДок=Результат;
		ТабДок.Очистить();
		
		Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.торо_ВыявленныеДефекты.ПФ_MXL_ЖурналДефектов");
		// Заголовок
		Область = Макет.ПолучитьОбласть("Заголовок");
		ТабДок.Вывести(Область);
		
		// Отбор
		ВывестиОбласть = Ложь;
		Область = Макет.ПолучитьОбласть("Отбор");
		Если ЗначениеЗаполнено(Организация) Тогда
			ВывестиОбласть					= Истина;
			Область.Параметры.Организация	= Организация;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
			ВывестиОбласть								= Истина;
			Область.Параметры.ПодразделениеОрганизации	= ПодразделениеОрганизации;
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ОР) Тогда
			ВывестиОбласть			= Истина;
			Область.Параметры.ОР	= торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(ОР);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(НачПериода) И ЗначениеЗаполнено(КонПериода) Тогда
			ВывестиОбласть			= Истина;
			// >> [Деснол] [Ушаков А.Д.] [04.10.2019] 
			Область.Параметры.Дата = СтрШаблон(НСтр("es='Período: %1: %2';ru='Период с: %1 по: %2';en='The period from: %1 to: %2'"), НачПериода, КонПериода);
			//Область.Параметры.Дата	= "Период с: " + НачПериода + " по: " + КонПериода;
			// << [Деснол] [Ушаков А.Д.] [04.10.2019] 
		КонецЕсли;
		
		Если ВывестиОбласть Тогда
			ТабДок.Вывести(Область);
		КонецЕсли;
		
		СписокДефектов = Новый Запрос();		
		
		СписокДефектов.Текст ="ВЫБРАТЬ
		                      |	торо_ВыявленныеДефектыСписокДефектов.ID,
		                      |	торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта,
		                      |	торо_ВыявленныеДефектыСписокДефектов.ОтказавшийЭлемент,
		                      |	торо_ВыявленныеДефектыСписокДефектов.ДефектОписание,
		                      |	торо_ВыявленныеДефектыСписокДефектов.ДефектПричина,
		                      |	торо_ВыявленныеДефектыСписокДефектов.ВидДефекта,
		                      |	торо_ВыявленныеДефектыСписокДефектов.ПоследствияДефекта,
		                      |	торо_ВыявленныеДефектыСписокДефектов.НаправлениеНаУстранение,
		                      |	торо_ВыявленныеДефектыСписокДефектов.Ссылка.Организация,
		                      |	торо_ВыявленныеДефектыСписокДефектов.Ссылка.ДатаОбнаружения,
		                      |	торо_ВыявленныеДефектыСписокДефектов.Ссылка.Ответственный,
		                      |	торо_ВыявленныеДефектыСписокДефектов.Ссылка.Подразделение
		                      |ПОМЕСТИТЬ ВТДефекты
		                      |ИЗ
		                      |	Документ.торо_ВыявленныеДефекты.СписокДефектов КАК торо_ВыявленныеДефектыСписокДефектов
		                      |ГДЕ
		                      |	ВЫБОР
		                      |			КОГДА &Организация = НЕОПРЕДЕЛЕНО
		                      |				ТОГДА ИСТИНА
		                      |			ИНАЧЕ торо_ВыявленныеДефектыСписокДефектов.Ссылка.Организация = &Организация
		                      |		КОНЕЦ
		                      |	И ВЫБОР
		                      |			КОГДА &ОбъектРемонта = НЕОПРЕДЕЛЕНО
		                      |				ТОГДА ИСТИНА
		                      |			ИНАЧЕ ВЫБОР
		                      |					КОГДА &ОбъектРемонтаРодитель = НЕОПРЕДЕЛЕНО
		                      |						ТОГДА торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта = &ОбъектРемонта
		                      |					ИНАЧЕ торо_ВыявленныеДефектыСписокДефектов.ОбъектРемонта В ИЕРАРХИИ (&ОбъектРемонтаРодитель)
		                      |				КОНЕЦ
		                      |		КОНЕЦ
		                      |	И ВЫБОР
		                      |			КОГДА &Подразделение = НЕОПРЕДЕЛЕНО
		                      |				ТОГДА ИСТИНА
		                      |			ИНАЧЕ торо_ВыявленныеДефектыСписокДефектов.Ссылка.Подразделение = &Подразделение
		                      |		КОНЕЦ
		                      |	И ВЫБОР
		                      |			КОГДА &НачПериода = ""НЕОПРЕДЕЛЕНО""
		                      |					ИЛИ &КонПериода = ""НЕОПРЕДЕЛЕНО""
		                      |				ТОГДА ИСТИНА
		                      |			ИНАЧЕ торо_ВыявленныеДефектыСписокДефектов.Ссылка.ДатаОбнаружения МЕЖДУ &НачПериода И &КонПериода
		                      |		КОНЕЦ
		                      |	И торо_ВыявленныеДефектыСписокДефектов.Ссылка.Проведен
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	торо_Ремонты.Регистратор,
		                      |	торо_Ремонты.ID
		                      |ПОМЕСТИТЬ ВТРСРемонты
		                      |ИЗ
		                      |	РегистрСведений.торо_Ремонты КАК торо_Ремонты
		                      |ГДЕ
		                      |	торо_Ремонты.ID В
		                      |			(ВЫБРАТЬ
		                      |				ВТДефекты.ID
		                      |			ИЗ
		                      |				ВТДефекты)
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ
		                      |	ВТРСРемонты.Регистратор,
		                      |	ВТДефекты.ОбъектРемонта КАК ОбъектРемонта,
		                      |	ВТДефекты.ОтказавшийЭлемент,
		                      |	ВТДефекты.ДефектОписание,
		                      |	ВТДефекты.ДефектПричина,
		                      |	ВТДефекты.ВидДефекта,
		                      |	ВТДефекты.ПоследствияДефекта,
		                      |	ВТДефекты.НаправлениеНаУстранение,
		                      |	ВТДефекты.ID,
		                      |	ВТДефекты.Подразделение,
		                      |	ВТДефекты.Ответственный,
		                      |	ВТДефекты.ДатаОбнаружения,
		                      |	ВТДефекты.Организация
		                      |ПОМЕСТИТЬ ВТДефектыОборудования
		                      |ИЗ
		                      |	ВТДефекты КАК ВТДефекты
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТРСРемонты КАК ВТРСРемонты
		                      |		ПО ВТДефекты.ID = ВТРСРемонты.ID
		                      |ГДЕ
		                      |	ТИПЗНАЧЕНИЯ(ВТРСРемонты.Регистратор) = ТИП(Документ.торо_ВыявленныеДефекты)
		                      |;
		                      |
		                      |////////////////////////////////////////////////////////////////////////////////
		                      |ВЫБРАТЬ РАЗЛИЧНЫЕ
		                      |	ВТДефектыОборудования.Регистратор,
		                      |	ВТДефектыОборудования.ОбъектРемонта,
		                      |	ВТДефектыОборудования.ОтказавшийЭлемент,
		                      |	ВТДефектыОборудования.ДефектОписание,
		                      |	ВТДефектыОборудования.ДефектПричина,
		                      |	ВТДефектыОборудования.ВидДефекта,
		                      |	ВТДефектыОборудования.ПоследствияДефекта,
		                      |	ВТДефектыОборудования.НаправлениеНаУстранение,
		                      |	ВТДефектыОборудования.ID,
		                      |	ВЫБОР
		                      |		КОГДА торо_ЗавершенныеРемонтныеРаботы.ID ЕСТЬ NULL 
		                      |			ТОГДА isnull(ВТРСРемонты.Регистратор,ВТДефектыОборудования.Регистратор)
		                      |		ИНАЧЕ торо_ЗавершенныеРемонтныеРаботы.Регистратор
		                      |	КОНЕЦ КАК Регистратор1,
		                      |	ВЫБОР
		                      |		КОГДА торо_ЗавершенныеРемонтныеРаботы.ID ЕСТЬ NULL 
		                      |			ТОГДА ""Не устранен""
		                      |		ИНАЧЕ ""Устранен""
		                      |	КОНЕЦ КАК Устранен,
		                      |	ВЫБОР
		                      |		КОГДА торо_ЗавершенныеРемонтныеРаботы.ID ЕСТЬ NULL 
		                      |			ТОГДА ВЫБОР
		                      |					КОГДА ВТРСРемонты.ID ЕСТЬ NULL 
		                      |						ТОГДА ""Зарегистрирован""
		                      |					ИНАЧЕ ВЫБОР
		                      |							КОГДА ТИПЗНАЧЕНИЯ(ВТРСРемонты.Регистратор) = ТИП(Документ.торо_ЗаявкаНаРемонт)
		                      |								ТОГДА ""Работы не начаты""
		                      |							ИНАЧЕ ""Работы начаты""
		                      |						КОНЕЦ
		                      |				КОНЕЦ
		                      |		ИНАЧЕ ""Работы завершены""
		                      |	КОНЕЦ КАК СостояниеРабот,
		                      |ВЫБОР
		                      |		КОГДА торо_ЗавершенныеРемонтныеРаботы.ID ЕСТЬ NULL 
		                      |			ТОГДА ВЫБОР
		                      |				КОГДА ВТРСРемонты.ID ЕСТЬ NULL 
		                      |					ТОГДА 0
		                      |				ИНАЧЕ ВЫБОР
		                      |					КОГДА ТИПЗНАЧЕНИЯ(ВТРСРемонты.Регистратор) = ТИП(Документ.торо_ЗаявкаНаРемонт)
		                      |						ТОГДА 2
		                      |					ИНАЧЕ 3
		                      |				КОНЕЦ
		                      |			КОНЕЦ
		                      |		ИНАЧЕ 1
		                      |КОНЕЦ КАК СтатусСортировки,
		                      |	ВТДефектыОборудования.ДатаОбнаружения,
		                      |	ВТДефектыОборудования.Ответственный
		                      |ИЗ
		                      |	ВТДефектыОборудования КАК ВТДефектыОборудования
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.торо_ЗавершенныеРемонтныеРаботы КАК торо_ЗавершенныеРемонтныеРаботы
		                      |		ПО ВТДефектыОборудования.ID = торо_ЗавершенныеРемонтныеРаботы.ID
		                      |		ЛЕВОЕ СОЕДИНЕНИЕ ВТРСРемонты КАК ВТРСРемонты
		                      |		ПО ВТДефектыОборудования.ID = ВТРСРемонты.ID
		                      |			И (ТИПЗНАЧЕНИЯ(ВТРСРемонты.Регистратор) = ТИП(Документ.торо_НарядНаВыполнениеРемонтныхРабот)
		                      |				ИЛИ ТИПЗНАЧЕНИЯ(ВТРСРемонты.Регистратор) = ТИП(Документ.торо_ЗаявкаНаРемонт)
		                      |				ИЛИ ТИПЗНАЧЕНИЯ(ВТРСРемонты.Регистратор) = ТИП(Документ.торо_АктОВыполненииЭтапаРабот))
		                      |
		                      |УПОРЯДОЧИТЬ ПО
		                      |	ВТДефектыОборудования.ДатаОбнаружения,
		                      |	СтатусСортировки УБЫВ
		                      |ИТОГИ ПО
		                      |	ВТДефектыОборудования.ID";
		
		// >> [Деснол] [Ушаков А.Д.] [04.10.2019]
		ТекстЗапроса = СписокДефектов.Текст;

		Переводы = Новый Соответствие;

		Переводы.Вставить("_РаботыЗавершены", НСтр("es='El trabajo se haya completado';ru='Работы завершены';en='Work completed'"));
		Переводы.Вставить("_Зарегистрирован", НСтр("es='Registrado';ru='Зарегистрирован';en='Registered'"));
		Переводы.Вставить("_НеУстранен", НСтр("es='No eliminado';ru='Не устранен';en='Not eliminated'"));
		Переводы.Вставить("_Устранен", НСтр("es='Eliminado';ru='Устранен';en='Fixed'"));
		Переводы.Вставить("_РаботыНеНачаты", НСтр("es='El trabajo no se desarrollan';ru='Работы не начаты';en='Work is not started'"));
		Переводы.Вставить("_РаботыНачаты", НСтр("es='El trabajo iniciado';ru='Работы начаты';en='Work started'"));

		СтрокиЗамены = Новый Соответствие;

		СтрокиЗамены.Вставить("""Работы завершены""", "&_РаботыЗавершены");
		СтрокиЗамены.Вставить("""Зарегистрирован""", "&_Зарегистрирован");
		СтрокиЗамены.Вставить("""Не устранен""", "&_НеУстранен");
		СтрокиЗамены.Вставить("""Устранен""", "&_Устранен");
		СтрокиЗамены.Вставить("""Работы не начаты""", "&_РаботыНеНачаты");
		СтрокиЗамены.Вставить("""Работы начаты""", "&_РаботыНачаты");

		Для каждого КодЗамены Из СтрокиЗамены Цикл
			ТекстЗапроса = СтрЗаменить(ТекстЗапроса, КодЗамены.Ключ, КодЗамены.Значение);
		КонецЦикла;

		СписокДефектов.Текст = ТекстЗапроса;

		Для каждого Перевод Из Переводы Цикл
			СписокДефектов.УстановитьПараметр(Перевод.Ключ, Перевод.Значение);
		КонецЦикла;
		// << [Деснол] [Ушаков А.Д.] [04.10.2019] 
		
		// СписокДефектов
		Область = Макет.ПолучитьОбласть("СписокДефектовШапка");
		ТабДок.Вывести(Область);
		ОбластьСписокДефектов = Макет.ПолучитьОбласть("СписокДефектов");
		
		// Если поле "Организация" заполнено, то в запросе отбор по ней
		Если ЗначениеЗаполнено(Организация) Тогда
			СписокДефектов.УстановитьПараметр("Организация", Организация);
		Иначе
			СписокДефектов.УстановитьПараметр("Организация", Неопределено);
		КонецЕсли;
		
		// Если поле "Подразделение" заполнено, то в запросе отбор по нему
		Если ЗначениеЗаполнено(ПодразделениеОрганизации) Тогда
			СписокДефектов.УстановитьПараметр("Подразделение", ПодразделениеОрганизации);
		Иначе
			СписокДефектов.УстановитьПараметр("Подразделение", Неопределено);
		КонецЕсли;	
		
		// Если поле "ОР" заполнено, то в запросе отбор по нему
		СписокОРДляОтбора = Новый СписокЗначений;
		Если ЗначениеЗаполнено(ОР) Тогда
			СписокДефектов.УстановитьПараметр("ОбъектРемонтаРодитель", Неопределено);
			СписокДефектов.УстановитьПараметр("ОбъектРемонта", ОР);	
		Иначе
			СписокДефектов.УстановитьПараметр("ОбъектРемонта", Неопределено);
			СписокДефектов.УстановитьПараметр("ОбъектРемонтаРодитель", Неопределено);
		КонецЕсли;	
		
		// Если поля "Даты" заполнено, то в запросе отбор по ним
		Если ЗначениеЗаполнено(НачПериода) И ЗначениеЗаполнено(КонПериода) Тогда
			СписокДефектов.УстановитьПараметр("НачПериода", НачалоДня(НачПериода));
			СписокДефектов.УстановитьПараметр("КонПериода", КонецДня(КонПериода));
		Иначе
			СписокДефектов.УстановитьПараметр("НачПериода", "НЕОПРЕДЕЛЕНО");
			СписокДефектов.УстановитьПараметр("КонПериода", "НЕОПРЕДЕЛЕНО");
		КонецЕсли;		
		
		ДефектыВыборка		 = СписокДефектов.Выполнить().Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
		Пока ДефектыВыборка.Следующий() Цикл 
			
			Выборка = ДефектыВыборка.Выбрать(ОбходРезультатаЗапроса.ПоГруппировкам);
			Если Выборка.Следующий() Тогда
				ОбластьСписокДефектов.Параметры.Заполнить(Выборка);
				ОбластьСписокДефектов.Параметры.ОбъектРемонтаПредставление = торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(Выборка.ОбъектРемонта);
				ОбластьСписокДефектов.Параметры.ОтказавшийЭлементПредставление = торо_ЗаполнениеДокументов.ПолучитьПредоставленияОРДляПечати(Выборка.ОтказавшийЭлемент);
				ТабДок.Вывести(ОбластьСписокДефектов);
			КонецЕсли;
			
		КонецЦикла;
		
		ТабДок.ОтображатьСетку = Ложь;
		ТабДок.Защита = Ложь;
		ТабДок.ТолькоПросмотр = Истина;
		ТабДок.ОтображатьЗаголовки = Ложь;
		// Зададим параметры макета
		ТабДок.ПолеСверху         = 0;
		ТабДок.ПолеСлева          = 0;
		ТабДок.ПолеСнизу          = 0;
		ТабДок.ПолеСправа         = 0;
		ТабДок.ОриентацияСтраницы = ОриентацияСтраницы.Ландшафт;
		ТабДок.АвтоМасштаб  = ИСТИНА;
		
		Возврат ТабДок;

КонецФункции

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Свойство("ПараметрыОтбора") Тогда
		КонПериода = Параметры.ПараметрыОтбора.КонПериода;
		НачПериода = Параметры.ПараметрыОтбора.НачПериода;
		ОР = Параметры.ПараметрыОтбора.ОР;
		Организация = Параметры.ПараметрыОтбора.Организация;
		ПодразделениеОрганизации = Параметры.ПараметрыОтбора.ПодразделениеДляДок;
	Иначе 
		НачПериода = НачалоГода(ТекущаяДата());
		КонПериода = КонецГода(ТекущаяДата());
		Организация = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР","ОсновнаяОрганизация",Истина);
		ПодразделениеОрганизации = ОбщегоНазначения.ХранилищеОбщихНастроекЗагрузить("НастройкиТОиР","ОсновноеПодразделение",Истина);
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти
